zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/usbd_reg.h
#define USBD_EPSTS1_EPSTS11_Pos          (12)                                              /*!< USBD_T::EPSTS1: EPSTS11 Position       */
#define USBD_EPSTS1_EPSTS11_Msk          (0xful << USBD_EPSTS1_EPSTS11_Pos)                /*!< USBD_T::EPSTS1: EPSTS11 Mask           */

#define USBD_EPSTS1_EPSTS12_Pos          (16)                                              /*!< USBD_T::EPSTS1: EPSTS12 Position       */
#define USBD_EPSTS1_EPSTS12_Msk          (0xful << USBD_EPSTS1_EPSTS12_Pos)                /*!< USBD_T::EPSTS1: EPSTS12 Mask           */

#define USBD_EPSTS1_EPSTS13_Pos          (20)                                              /*!< USBD_T::EPSTS1: EPSTS13 Position       */
#define USBD_EPSTS1_EPSTS13_Msk          (0xful << USBD_EPSTS1_EPSTS13_Pos)                /*!< USBD_T::EPSTS1: EPSTS13 Mask           */

#define USBD_EPSTS1_EPSTS14_Pos          (24)                                              /*!< USBD_T::EPSTS1: EPSTS14 Position       */
#define USBD_EPSTS1_EPSTS14_Msk          (0xful << USBD_EPSTS1_EPSTS14_Pos)                /*!< USBD_T::EPSTS1: EPSTS14 Mask           */

#define USBD_EPSTS1_EPSTS15_Pos          (28)                                              /*!< USBD_T::EPSTS1: EPSTS15 Position       */
#define USBD_EPSTS1_EPSTS15_Msk          (0xful << USBD_EPSTS1_EPSTS15_Pos)                /*!< USBD_T::EPSTS1: EPSTS15 Mask           */

#define USBD_EPSTS2_EPSTS16_Pos          (0)                                               /*!< USBD_T::EPSTS2: EPSTS16 Position       */
#define USBD_EPSTS2_EPSTS16_Msk          (0xful << USBD_EPSTS2_EPSTS16_Pos)                /*!< USBD_T::EPSTS2: EPSTS16 Mask           */

#define USBD_EPSTS2_EPSTS17_Pos          (4)                                               /*!< USBD_T::EPSTS2: EPSTS17 Position       */
#define USBD_EPSTS2_EPSTS17_Msk          (0xful << USBD_EPSTS2_EPSTS17_Pos)                /*!< USBD_T::EPSTS2: EPSTS17 Mask           */

#define USBD_EPSTS2_EPSTS18_Pos          (8)                                               /*!< USBD_T::EPSTS2: EPSTS18 Position       */
#define USBD_EPSTS2_EPSTS18_Msk          (0xful << USBD_EPSTS2_EPSTS18_Pos)                /*!< USBD_T::EPSTS2: EPSTS18 Mask           */

#define USBD_EPSTS2_EPSTS19_Pos          (12)                                              /*!< USBD_T::EPSTS2: EPSTS19 Position       */
#define USBD_EPSTS2_EPSTS19_Msk          (0xful << USBD_EPSTS2_EPSTS19_Pos)                /*!< USBD_T::EPSTS2: EPSTS19 Mask           */

#define USBD_EPSTS2_EPSTS20_Pos          (16)                                              /*!< USBD_T::EPSTS2: EPSTS20 Position       */
#define USBD_EPSTS2_EPSTS20_Msk          (0xful << USBD_EPSTS2_EPSTS20_Pos)                /*!< USBD_T::EPSTS2: EPSTS20 Mask           */

#define USBD_EPSTS2_EPSTS21_Pos          (20)                                              /*!< USBD_T::EPSTS2: EPSTS21 Position       */
#define USBD_EPSTS2_EPSTS21_Msk          (0xful << USBD_EPSTS2_EPSTS21_Pos)                /*!< USBD_T::EPSTS2: EPSTS21 Mask           */

#define USBD_EPSTS2_EPSTS22_Pos          (24)                                              /*!< USBD_T::EPSTS2: EPSTS22 Position       */
#define USBD_EPSTS2_EPSTS22_Msk          (0xful << USBD_EPSTS2_EPSTS22_Pos)                /*!< USBD_T::EPSTS2: EPSTS22 Mask           */

#define USBD_EPSTS2_EPSTS23_Pos          (28)                                              /*!< USBD_T::EPSTS2: EPSTS23 Position       */
#define USBD_EPSTS2_EPSTS23_Msk          (0xful << USBD_EPSTS2_EPSTS23_Pos)                /*!< USBD_T::EPSTS2: EPSTS23 Mask           */

#define USBD_EPSTS3_EPSTS24_Pos          (0)                                               /*!< USBD_T::EPSTS3: EPSTS24 Position       */
#define USBD_EPSTS3_EPSTS24_Msk          (0xful << USBD_EPSTS3_EPSTS24_Pos)                /*!< USBD_T::EPSTS3: EPSTS24 Mask           */

#define USBD_EPINTSTS_EPEVT0_Pos         (0)                                               /*!< USBD_T::EPINTSTS: EPEVT0 Position      */
#define USBD_EPINTSTS_EPEVT0_Msk         (0x1ul << USBD_EPINTSTS_EPEVT0_Pos)               /*!< USBD_T::EPINTSTS: EPEVT0 Mask          */

#define USBD_EPINTSTS_EPEVT1_Pos         (1)                                               /*!< USBD_T::EPINTSTS: EPEVT1 Position      */
#define USBD_EPINTSTS_EPEVT1_Msk         (0x1ul << USBD_EPINTSTS_EPEVT1_Pos)               /*!< USBD_T::EPINTSTS: EPEVT1 Mask          */

#define USBD_EPINTSTS_EPEVT2_Pos         (2)                                               /*!< USBD_T::EPINTSTS: EPEVT2 Position      */
#define USBD_EPINTSTS_EPEVT2_Msk         (0x1ul << USBD_EPINTSTS_EPEVT2_Pos)               /*!< USBD_T::EPINTSTS: EPEVT2 Mask          */

#define USBD_EPINTSTS_EPEVT3_Pos         (3)                                               /*!< USBD_T::EPINTSTS: EPEVT3 Position      */
#define USBD_EPINTSTS_EPEVT3_Msk         (0x1ul << USBD_EPINTSTS_EPEVT3_Pos)               /*!< USBD_T::EPINTSTS: EPEVT3 Mask          */

#define USBD_EPINTSTS_EPEVT4_Pos         (4)                                               /*!< USBD_T::EPINTSTS: EPEVT4 Position      */
#define USBD_EPINTSTS_EPEVT4_Msk         (0x1ul << USBD_EPINTSTS_EPEVT4_Pos)               /*!< USBD_T::EPINTSTS: EPEVT4 Mask          */

#define USBD_EPINTSTS_EPEVT5_Pos         (5)                                               /*!< USBD_T::EPINTSTS: EPEVT5 Position      */
#define USBD_EPINTSTS_EPEVT5_Msk         (0x1ul << USBD_EPINTSTS_EPEVT5_Pos)               /*!< USBD_T::EPINTSTS: EPEVT5 Mask          */

#define USBD_EPINTSTS_EPEVT6_Pos         (6)                                               /*!< USBD_T::EPINTSTS: EPEVT6 Position      */
#define USBD_EPINTSTS_EPEVT6_Msk         (0x1ul << USBD_EPINTSTS_EPEVT6_Pos)               /*!< USBD_T::EPINTSTS: EPEVT6 Mask          */

#define USBD_EPINTSTS_EPEVT7_Pos         (7)                                               /*!< USBD_T::EPINTSTS: EPEVT7 Position      */
#define USBD_EPINTSTS_EPEVT7_Msk         (0x1ul << USBD_EPINTSTS_EPEVT7_Pos)               /*!< USBD_T::EPINTSTS: EPEVT7 Mask          */

#define USBD_EPINTSTS_EPEVT8_Pos         (8)                                               /*!< USBD_T::EPINTSTS: EPEVT8 Position      */
#define USBD_EPINTSTS_EPEVT8_Msk         (0x1ul << USBD_EPINTSTS_EPEVT8_Pos)               /*!< USBD_T::EPINTSTS: EPEVT8 Mask          */

#define USBD_EPINTSTS_EPEVT9_Pos         (9)                                               /*!< USBD_T::EPINTSTS: EPEVT9 Position      */
#define USBD_EPINTSTS_EPEVT9_Msk         (0x1ul << USBD_EPINTSTS_EPEVT9_Pos)               /*!< USBD_T::EPINTSTS: EPEVT9 Mask          */

#define USBD_EPINTSTS_EPEVT10_Pos        (10)                                              /*!< USBD_T::EPINTSTS: EPEVT10 Position     */
#define USBD_EPINTSTS_EPEVT10_Msk        (0x1ul << USBD_EPINTSTS_EPEVT10_Pos)              /*!< USBD_T::EPINTSTS: EPEVT10 Mask         */

