zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/usbd_reg.h
#define USBD_EPINTSTS_EPEVT11_Pos        (11)                                              /*!< USBD_T::EPINTSTS: EPEVT11 Position     */
#define USBD_EPINTSTS_EPEVT11_Msk        (0x1ul << USBD_EPINTSTS_EPEVT11_Pos)              /*!< USBD_T::EPINTSTS: EPEVT11 Mask         */

#define USBD_EPINTSTS_EPEVT12_Pos        (12)                                              /*!< USBD_T::EPINTSTS: EPEVT12 Position     */
#define USBD_EPINTSTS_EPEVT12_Msk        (0x1ul << USBD_EPINTSTS_EPEVT12_Pos)              /*!< USBD_T::EPINTSTS: EPEVT12 Mask         */

#define USBD_EPINTSTS_EPEVT13_Pos        (13)                                              /*!< USBD_T::EPINTSTS: EPEVT13 Position     */
#define USBD_EPINTSTS_EPEVT13_Msk        (0x1ul << USBD_EPINTSTS_EPEVT13_Pos)              /*!< USBD_T::EPINTSTS: EPEVT13 Mask         */

#define USBD_EPINTSTS_EPEVT14_Pos        (14)                                              /*!< USBD_T::EPINTSTS: EPEVT14 Position     */
#define USBD_EPINTSTS_EPEVT14_Msk        (0x1ul << USBD_EPINTSTS_EPEVT14_Pos)              /*!< USBD_T::EPINTSTS: EPEVT14 Mask         */

#define USBD_EPINTSTS_EPEVT15_Pos        (15)                                              /*!< USBD_T::EPINTSTS: EPEVT15 Position     */
#define USBD_EPINTSTS_EPEVT15_Msk        (0x1ul << USBD_EPINTSTS_EPEVT15_Pos)              /*!< USBD_T::EPINTSTS: EPEVT15 Mask         */

#define USBD_EPINTSTS_EPEVT16_Pos        (16)                                              /*!< USBD_T::EPINTSTS: EPEVT16 Position     */
#define USBD_EPINTSTS_EPEVT16_Msk        (0x1ul << USBD_EPINTSTS_EPEVT16_Pos)              /*!< USBD_T::EPINTSTS: EPEVT16 Mask         */

#define USBD_EPINTSTS_EPEVT17_Pos        (17)                                              /*!< USBD_T::EPINTSTS: EPEVT17 Position     */
#define USBD_EPINTSTS_EPEVT17_Msk        (0x1ul << USBD_EPINTSTS_EPEVT17_Pos)              /*!< USBD_T::EPINTSTS: EPEVT17 Mask         */

#define USBD_EPINTSTS_EPEVT18_Pos        (18)                                              /*!< USBD_T::EPINTSTS: EPEVT18 Position     */
#define USBD_EPINTSTS_EPEVT18_Msk        (0x1ul << USBD_EPINTSTS_EPEVT18_Pos)              /*!< USBD_T::EPINTSTS: EPEVT18 Mask         */

#define USBD_EPINTSTS_EPEVT19_Pos        (19)                                              /*!< USBD_T::EPINTSTS: EPEVT19 Position     */
#define USBD_EPINTSTS_EPEVT19_Msk        (0x1ul << USBD_EPINTSTS_EPEVT19_Pos)              /*!< USBD_T::EPINTSTS: EPEVT19 Mask         */

#define USBD_EPINTSTS_EPEVT20_Pos        (20)                                              /*!< USBD_T::EPINTSTS: EPEVT20 Position     */
#define USBD_EPINTSTS_EPEVT20_Msk        (0x1ul << USBD_EPINTSTS_EPEVT20_Pos)              /*!< USBD_T::EPINTSTS: EPEVT20 Mask         */

#define USBD_EPINTSTS_EPEVT21_Pos        (21)                                              /*!< USBD_T::EPINTSTS: EPEVT21 Position     */
#define USBD_EPINTSTS_EPEVT21_Msk        (0x1ul << USBD_EPINTSTS_EPEVT21_Pos)              /*!< USBD_T::EPINTSTS: EPEVT21 Mask         */

#define USBD_EPINTSTS_EPEVT22_Pos        (22)                                              /*!< USBD_T::EPINTSTS: EPEVT22 Position     */
#define USBD_EPINTSTS_EPEVT22_Msk        (0x1ul << USBD_EPINTSTS_EPEVT22_Pos)              /*!< USBD_T::EPINTSTS: EPEVT22 Mask         */

#define USBD_EPINTSTS_EPEVT23_Pos        (23)                                              /*!< USBD_T::EPINTSTS: EPEVT23 Position     */
#define USBD_EPINTSTS_EPEVT23_Msk        (0x1ul << USBD_EPINTSTS_EPEVT23_Pos)              /*!< USBD_T::EPINTSTS: EPEVT23 Mask         */

#define USBD_EPINTSTS_EPEVT24_Pos        (24)                                              /*!< USBD_T::EPINTSTS: EPEVT24 Position     */
#define USBD_EPINTSTS_EPEVT24_Msk        (0x1ul << USBD_EPINTSTS_EPEVT24_Pos)              /*!< USBD_T::EPINTSTS: EPEVT24 Mask         */

#define USBD_LPMATTR_LPMLINKSTS_Pos      (0)                                               /*!< USBD_T::LPMATTR: LPMLINKSTS Position   */
#define USBD_LPMATTR_LPMLINKSTS_Msk      (0xful << USBD_LPMATTR_LPMLINKSTS_Pos)            /*!< USBD_T::LPMATTR: LPMLINKSTS Mask       */

#define USBD_LPMATTR_LPMBESL_Pos         (4)                                               /*!< USBD_T::LPMATTR: LPMBESL Position      */
#define USBD_LPMATTR_LPMBESL_Msk         (0xful << USBD_LPMATTR_LPMBESL_Pos)               /*!< USBD_T::LPMATTR: LPMBESL Mask          */

#define USBD_LPMATTR_LPMRWAKUP_Pos       (8)                                               /*!< USBD_T::LPMATTR: LPMRWAKUP Position    */
#define USBD_LPMATTR_LPMRWAKUP_Msk       (0x1ul << USBD_LPMATTR_LPMRWAKUP_Pos)             /*!< USBD_T::LPMATTR: LPMRWAKUP Mask        */

#define USBD_FN_FN_Pos                   (0)                                               /*!< USBD_T::FN: FN Position                */
#define USBD_FN_FN_Msk                   (0x7fful << USBD_FN_FN_Pos)                       /*!< USBD_T::FN: FN Mask                    */

#define USBD_SE0_SE0_Pos                 (0)                                               /*!< USBD_T::SE0: SE0 Position              */
#define USBD_SE0_SE0_Msk                 (0x1ul << USBD_SE0_SE0_Pos)                       /*!< USBD_T::SE0: SE0 Mask                  */

#define USBD_BUFSEG_BUFSEG_Pos           (3)                                               /*!< USBD_EP_T::BUFSEG: BUFSEG Position     */
#define USBD_BUFSEG_BUFSEG_Msk           (0xfful << USBD_BUFSEG_BUFSEG_Pos)                /*!< USBD_EP_T::BUFSEG: BUFSEG Mask         */

#define USBD_MXPLD_MXPLD_Pos             (0)                                               /*!< USBD_EP_T::MXPLD: MXPLD Position       */
#define USBD_MXPLD_MXPLD_Msk             (0x7fful << USBD_MXPLD_MXPLD_Pos)                 /*!< USBD_EP_T::MXPLD: MXPLD Mask           */

#define USBD_CFG_EPNUM_Pos               (0)                                               /*!< USBD_EP_T::CFG: EPNUM Position         */
#define USBD_CFG_EPNUM_Msk               (0xful << USBD_CFG_EPNUM_Pos)                     /*!< USBD_EP_T::CFG: EPNUM Mask             */

#define USBD_CFG_ISOCH_Pos               (4)                                               /*!< USBD_EP_T::CFG: ISOCH Position         */
#define USBD_CFG_ISOCH_Msk               (0x1ul << USBD_CFG_ISOCH_Pos)                     /*!< USBD_EP_T::CFG: ISOCH Mask             */

#define USBD_CFG_STATE_Pos               (5)                                               /*!< USBD_EP_T::CFG: STATE Position         */
#define USBD_CFG_STATE_Msk               (0x3ul << USBD_CFG_STATE_Pos)                     /*!< USBD_EP_T::CFG: STATE Mask             */

#define USBD_CFG_DSQSYNC_Pos             (7)                                               /*!< USBD_EP_T::CFG: DSQSYNC Position       */
#define USBD_CFG_DSQSYNC_Msk             (0x1ul << USBD_CFG_DSQSYNC_Pos)                   /*!< USBD_EP_T::CFG: DSQSYNC Mask           */

